dangernoodle-io/breadboard/examples/smoke/sdkconfig.defaults.esp32-cache-sweep
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Stack overflow detection: PTRVAL canary prints the overflowing task name
# instead of aborting silently. Original ESP32 has no assist-debug module
# (SOC_ASSIST_DEBUG_SUPPORTED is unset), so CONFIG_ESP_SYSTEM_HW_STACK_GUARD
# isn't available here -- pair with the end-of-stack hardware watchpoint for
# deterministic (not sampled-at-context-switch) detection. See
# components/bb_health/Kconfig.
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL=y
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_BB_LOG_ROUTES=y
CONFIG_BB_OTA_PULL_AUTOREGISTER=y
# Enable RST-based SSE abort teardown (B1-517): bb_http_req_async_abort's
# SO_LINGER{on,0} setsockopt is inert without this — see bb_http.h.
CONFIG_LWIP_SO_LINGER=y
# Exercise the bb_cache age-out SWEEP backstop in CI so
# bb_cache_evict_start()/sweep_thread_main() keep compiling+linking (default
# n, see components/bb_cache/Kconfig).
CONFIG_BB_CACHE_SWEEP_ENABLE=y
CONFIG_BB_CACHE_SWEEP_PERIOD_MS=5000
# Enable uxTaskGetSystemState (used by bb_task_registry's periodic base-scan
# and GET /api/diag/tasks) so per-task stack high-water-mark reporting is
# non-stub in smoke builds. See bb_task_registry Kconfig and
# platform/espidf/bb_task_registry/bb_task_registry_base_scan.c. Smoke-only:
# examples/floor deliberately stays minimal (B1-1296).
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# B1-1275: disable WPA2/WPA3-Enterprise WiFi -- the enterprise (802.1X/EAP)
# connection path is unused (no esp_wifi_sta_enterprise_*/esp_eap_client_*
# call sites); this shrinks compiled-in attack surface, not flash --
# linker --gc-sections was already stripping most of the dead code, so the
# measured delta is negligible either way (esp32 +168B, esp32c3 -722B).
# TLS, the mbedTLS cert bundle, and WPA3-Personal/SAE
# (CONFIG_ESP_WIFI_ENABLE_WPA3_SAE) are untouched.
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n

# B1-1482: same pin as sdkconfig.defaults.esp32 -- this board also only ever
# composes 2 genuinely-blocking clients (SSE+WS, examples/smoke/main/
# bb_wire.h), so pin the blocking-client budget to that real usage rather
# than letting it silently track the new CONFIG_BB_DATA_HTTP_MAX_CLIENTS
# default of 3 (which would trip bb_data_http_espidf.c's compile-time
# guard: 3*20=60ms >= the 50ms default sweep interval).
CONFIG_BB_DATA_HTTP_MAX_BLOCKING_CLIENTS=2
